'use strict';

module.exports.mockData = [
  {
    "id": `2LAAKH`,
    "title": `Как собрать камни бесконечности`,
    "announce": `Из под его пера вышло 8 платиновых альбомов. Достичь успеха помогут ежедневные повторения. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    "fullText": `Простые ежедневные упражнения помогут достичь успеха. Освоить вёрстку несложно. Возьмите новую книгу и закрепите все упражнения на практике. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Достичь успеха помогут ежедневные повторения. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Первая большая ёлка была установлена только в 1938 году. Как начать действовать? Для начала просто соберитесь. Программировать не настолько сложно, как об этом говорят. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Это один из лучших рок-музыкантов.`,
    "createdDate": `2021-03-22 00:46:46`,
    "category": [`IT`],
    "comments": [
      {"id": `tmc5Ff`, "postId": `2LAAKH`, "text": `Согласен с автором!`},
      {"id": `0cC8NB`, "postId": `2LAAKH`, "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты?`},
      {"id": `q3ZvS-`, "postId": `2LAAKH`, "text": `Хочу такую же футболку :-) Плюсую, но слишком много буквы! Мне кажется или я уже читал это где-то?`},
      {"id": `otM3JJ`, "postId": `2LAAKH`, "text": `Совсем немного... Согласен с автором!`}
    ]
  },
  {
    "id": `WDmnii`,
    "title": `Как перестать беспокоиться и начать жить`,
    "announce": `Из под его пера вышло 8 платиновых альбомов. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    "fullText": `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Достичь успеха помогут ежедневные повторения. Освоить вёрстку несложно. Возьмите новую книгу и закрепите все упражнения на практике. Из под его пера вышло 8 платиновых альбомов. Ёлки — это не просто красивое дерево. Это прочная древесина. Собрать камни бесконечности легко, если вы прирожденный герой. Простые ежедневные упражнения помогут достичь успеха. Программировать не настолько сложно, как об этом говорят. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Это один из лучших рок-музыкантов. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Золотое сечение — соотношение двух величин, гармоническая пропорция. Первая большая ёлка была установлена только в 1938 году.`,
    "createdDate": `2021-02-09 05:12:30`,
    "category": [`Кино`],
    "comments": [
      {"id": `lgYmNr`, "postId": `WDmnii`, "text": `Хочу такую же футболку :-) Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Совсем немного...`},
      {"id": `sxX1JR`, "postId": `WDmnii`, "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Хочу такую же футболку :-) Это где ж такие красоты?`},
      {"id": `jxa0WZ`, "postId": `WDmnii`, "text": `Согласен с автором! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`}
    ]
  }, {
    "id": `lSwei_`,
    "title": `Борьба с прокрастинацией`,
    "announce": `Первая большая ёлка была установлена только в 1938 году.`,
    "fullText": `Как начать действовать? Для начала просто соберитесь. Из под его пера вышло 8 платиновых альбомов. Он написал больше 30 хитов. Ёлки — это не просто красивое дерево. Это прочная древесина. Простые ежедневные упражнения помогут достичь успеха. Освоить вёрстку несложно. Возьмите новую книгу и закрепите все упражнения на практике. Первая большая ёлка была установлена только в 1938 году.`,
    "createdDate": `2021-03-02 20:24:36`,
    "category": [`Железо`, `Разное`, `IT`, `Музыка`],
    "comments": [
      {"id": `M7ewTu`, "postId": `lSwei_`, "text": `Плюсую, но слишком много буквы! Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`},
      {"id": `eBntZZ`, "postId": `lSwei_`, "text": `Согласен с автором! Это где ж такие красоты? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`}
    ]
  }, {
    "id": `6jED6n`,
    "title": `Ёлки. История деревьев`,
    "announce": `Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Это один из лучших рок-музыкантов. Из под его пера вышло 8 платиновых альбомов. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
    "fullText": `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Собрать камни бесконечности легко, если вы прирожденный герой. Освоить вёрстку несложно. Возьмите новую книгу и закрепите все упражнения на практике. Это один из лучших рок-музыкантов. Он написал больше 30 хитов. Как начать действовать? Для начала просто соберитесь. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Простые ежедневные упражнения помогут достичь успеха.`,
    "createdDate": `2021-02-27 13:10:49`,
    "category": [`Программирование`, `Деревья`, `Музыка`],
    "comments": [
      {"id": `LpOzLT`, "postId": `6jED6n`, "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Плюсую, но слишком много буквы!`},
      {"id": `hsKbqa`, "postId": `6jED6n`, "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Это где ж такие красоты? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`}, {"id": `FrpTnT`, "postId": `6jED6n`, "text": `Хочу такую же футболку :-)`}
    ]
  }, {
    "id": `MJNedN`,
    "title": `Борьба с прокрастинацией`,
    "announce": `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Программировать не настолько сложно, как об этом говорят. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Это один из лучших рок-музыкантов. Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    "fullText": `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Как начать действовать? Для начала просто соберитесь. Золотое сечение — соотношение двух величин, гармоническая пропорция. Программировать не настолько сложно, как об этом говорят. Простые ежедневные упражнения помогут достичь успеха.`,
    "createdDate": `2021-03-15 12:15:43`,
    "category": [`Кино`],
    "comments": [
      {"id": `WvnX8d`, "postId": `MJNedN`, "text": `Хочу такую же футболку :-) Плюсую, но слишком много буквы! Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`},
      {"id": `4kbchC`, "postId": `MJNedN`, "text": `Мне кажется или я уже читал это где-то? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Плюсую, но слишком много буквы!`},
      {"id": `woldkx`, "postId": `MJNedN`, "text": `Хочу такую же футболку :-)`},
      {"id": `HcAKIZ`, "postId": `MJNedN`, "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`}
    ]
  }
];
